import { Fragment } from "react";

const Research = () => {
  return (
    <Fragment>
      <h1>Research</h1>
      <p>
      ปัญหาคนแออัดในที่สาธารณะเป็นประเด็นที่มีความเกิดขึ้นบ่อยครั้งในสังคมขณะที่คนมากมายรวมตัวกันในพื้นที่สาธารณะ เช่น สถานีรถไฟ สถานีขนส่ง ตลาด สนามกีฬา ร้านค้า ห้างสรรพสินค้า และงานสัปดาห์ ปัญหาคนแออัดในที่สาธารณะสามารถอธิบายได้ด้วยคำที่ต่อไปนี้
                        1.ความไม่สะดวกสบาย:การเคลื่อนไหวภายในพื้นที่ที่แออัดอาจทำให้ผู้คนรู้สึกไม่สะดวกสบาย อาจมีการชนกัน ติดขัดกัน เหตุการณ์เช่นนี้ส่งผลให้ความพยุงมากขึ้น ทำให้เกิดความรำคาญและลดประสิทธิภาพในการเคลื่อนไหวของคนในพื้นที่นั้นๆ
                        2.ความเสี่ยงต่อความปลอดภัย: ความแออัดอาจทำให้มีโอกาสเกิดเหตุอันตรายเช่น การสูญเสียเอกสารส่วนตัว การถูกขโมย การหกล้ม หรือการเกิดอาการหวาดกลัวและวิตกกังวลในบริเตนต์ที่แออัด
                        3.การแพร่ระบาดของโรค: ความแออัดทำให้ความห่างกันระหว่างบุคคลลดลง นั่นอาจทำให้โรคติดต่อแพร่ระบาดได้ง่ายขึ้น ทำให้มีความเสี่ยงที่สูญเสียสุขภาพ
                        4.ความขัดแย้ง: สภาพแวดล้อมที่แออัดอาจส่งผลให้เกิดความขัดแย้งระหว่างบุคคล เช่น การอื่นรุนแรง น่าเกลียดชัง หรือการเกิดขัดแย้งทางความคิดเห็น
                        5.ความไม่เป็นธรรม: ในบางกรณี คนที่แออัดอาจละเลยสิทธิและความเป็นธรรมของผู้อื่น อาจส่งผลให้เกิดความเห็นชอบที่ไม่พอใจ สิ่งนี้อาจส่งผลให้เกิดข้อข้อพิพาทหรือปัญหาทางกฎหมาย
                        6.การมีอากาศไม่ดี: ความแออัดทำให้พื้นที่มีความหนาแน่นของคนสูง การหายใจของคนหลายคนทำให้มีความเสี่ยงที่จะหายใจไม่สะดวก และอาจเป็นอันตรายต่อผู้ที่มีปัญหาทางระบบทางเดินหายใจ
                        การจัดการปัญหาคนแออัดในที่สาธารณะจำเป็นต้องให้ความสำคัญในการวางแผนและสร้างพื้นที่ที่เหมาะสมให้กับความต้องการและความจำเป็นของประชาชน โดยพิจารณาความเป็นไปได้ในการต่อเติมและขยายพื้นที่ที่ความหนาแน่นของคนสูง นอกจากนี้ยังส่งเสริมความปลอดภัย สร้างมาตรการเพื่อควบคุมการแออัด และส่งเสริมความรับผิดชอบในการใช้พื้นที่สาธารณะให้มีความเป็นระเบียบและความเหมาะสม
      </p>
      <div class="nostrud">
                     <h3>รายละเอียด</h3>
                     <p style={{fontSize:"20px"}}>โปรแกรมภาษาpythonด้วยการ import โมดูลที่จำเป็น เช่น yolo,RPi.GPIO, OpenCV, หรืออื่นๆ
                        กำหนดค่าและกำหนดขา GPIO สำหรับเซ็นเซอร์หน้าและอุปกรณ์เสียงที่คุณใช้
                        เขียนฟังก์ชันหรือวงจรเพื่ออ่านข้อมูลจากเซ็นเซอร์หน้า และทำการตรวจจับหน้า
                        เมื่อตรวจจับหน้าสำเร็จ ให้เรียกใช้ฟังก์ชัน PyAudio, Sounddevice, หรือ Simpleaudio 
                        หรือวงจรเพื่อส่งสัญญาณเตือนเป็นเสียงผ่านอุปกรณ์เสียงอื่นๆ
                        เมื่อมีการตรวจพบผู้คนเป็นจำนวนมากส่งเสียงเตือนเพื่อลดการแออัด</p>
                  </div>
    </Fragment>
  );
};

export default Research;
